echo off
echo ------------------开始上海分钟线处理----------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file d:\yttrans\kettle\pricemin1.ktr "-param:sc=SH" "-param:db=172.34.0.205"
echo ------------------结束上海分钟线处理----------------------------------------------------------------------------------
echo ------------------开始深圳分钟线处理----------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file d:\yttrans\kettle\pricemin1.ktr "-param:sc=SZ" "-param:db=172.34.0.205"
echo ------------------结束深圳分钟线处理----------------------------------------------------------------------------------
echo ------------------开始中金所分钟线处理--------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file d:\yttrans\kettle\pricemin1.ktr "-param:sc=SF" "-param:db=172.34.0.205" -"param:fk=fkFutuMin"
echo ------------------结束中金所分钟线处理--------------------------------------------------------------------------------
