echo off
echo ------------------开始股票日线处理------------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file D:\trunkV2\DataTrans\kettle\priceday.ktr -"param:fk=fkStockDay"
echo ------------------结束股票日线处理------------------------------------------------------------------------------------
echo ------------------开始期货日线处理------------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file D:\trunkV2\DataTrans\kettle\priceday.ktr -"param:fk=fkFutuDay"
echo ------------------结束期货日线处理------------------------------------------------------------------------------------
echo ------------------开始期货结算价处理------------------------------------------------------------------------------------
call d:\yttrans\data-integration\pan.bat /file D:\trunkV2\DataTrans\kettle\priceday-jsj.ktr -"param:fk=fkFutuJsj"
echo ------------------结束期货结算价处理------------------------------------------------------------------------------------

